<h1>Операции</h1>
<h2>Арифметические операции</h2>
<p>+ - * / ** %</p>
<p>Инкремент и декремент</p>
<?php
$i = 5;
echo --$i; 
?>

<h2>Операция со строками - конкатенация</h2>
<?php 
$str1 = 'Hello, ';
$str2 = "world!";
echo $str1 . true;
?>

<h2>Операции сравнения</h2>
<p> < > == != <= >= </p>
<?php
$a = (5 < 5); //false
echo $a;
?>

<h2>Операции строгого сравнения</h2>
<p>===  !==</p>
<?php
$b = (5 == '5');
$c = (5 === '5');
echo "b = $b, c = $c";
?>
<h2>Логические операции</h2>
<p>И(&& или and) ИЛИ(|| или or) НЕ(!)</p>
<?php
$x = (true && false);
$y = (true || false);
echo "x = $x, y = $y";
?>
<h2>Операции присваивания</h2>
<p> = </p>
<?php
$d = 'Hello';
$e = 5;
$e += 7;
$f = 3;
$f *= $e; 
echo "$f";
?>
<p>= +=  -=  *=  /=  **=  .=  %= </p>
<h2>Приоритет операций</h2>
<p>** (++ --) ! (* / %) (+ - .) (< > <= >=) (== != === !==) && || (= += ...)</p>