<h1>Условия</h1>
<h2>Задание 1.</h2>
<?php
$a = 3;
$b = 5;
$c = $a + $b;
$d = $a * $b;
if($a < $b){
    echo "a = $a, b = $b, a + b = $c";
} else {
    echo "a = $a, b = $b, a * b = $d";
}
?>

<h2>Задание 2.</h2>
<?php
$c = 90;
$d = 60;
if($c == 90 || $d == 90){
    echo "Треугольник прямоугольный";
} else {
    echo "Треугольник не прямоугольный";
}
?>

<h2>Задание 3.</h2>
<?php
$age = 6;
if($age <= 1){
    echo "Группа котята";
} elseif($age > 1 && $age <= 3){
    echo "Группа молодые коты";
} elseif($age > 3 && $age <= 7){
    echo "Группа коты средних лет";
} elseif($age > 7){
    echo "Группа почтенные коты";
}
?>

<h2>Задание 4.</h2>
<?php 

?>