<h1>Условия</h1>
<h2>Задание 1.</h2>
<?php
$a = 3;
$b = 5;
$c = $a + $b;
$d = $a * $b;
if($a < $b){
    echo "a = $a, b = $b, a + b = $c";
} else {
    echo "a = $a, b = $b, a * b = $d";
}
?>

<h2>Задание 2.</h2>
<?php
$c = 90;
$d = 60;
if($c == 90 || $d == 90){
    echo "Треугольник прямоугольный";
} else {
    echo "Треугольник не прямоугольный";
}
?>

<h2>Задание 3.</h2>
<?php
$age = 6;
if($age <= 1){
    echo "Группа котята";
} elseif($age > 1 && $age <= 3){
    echo "Группа молодые коты";
} elseif($age > 3 && $age <= 7){
    echo "Группа коты средних лет";
} elseif($age > 7){
    echo "Группа почтенные коты";
}
?>

<h2>Задание 4.</h2>
<?php 
$a = 3;
$b = 4;
$c = 5;
if(($a + $b > $c) && ($a + $c > $b) && ($b + $c > $a)){
    echo "Такой треугольник существует";
} else{
    echo "Такого труегольника не существует";
}
?>

<h2>Задание 5.</h2>
<?php
$a = 2067;
if (($a % 400 == 0) || ($a % 4 == 0) && ($a % 100 != 0)) {
    echo "Год високосный";
} else {
    echo "Год не високосный";
}
?>

<h2>Задание 6.</h2>
<?php
$a = 4669;
$b = 3835;
$c = $a + $b;
if ($a + $b <= 32767) {
    echo "$c";
} else {
    echo "Переполнение";
}
?>

<h2>Задание 7.</h2>
<?php
$A = 5;
$B = 6;

$x = 6;
$y = 4;
$z = 2;

if (($x <= $A && $y <= $B) || 
($x <= $B && $y <= $A) || 
($x <= $A && $z <= $B) ||
($x <= $B && $z <= $A)||
($y <= $A && $z <= $B) ||
($y <= $B && $z <= $A)) {
    echo "Кирпич пройдет";
} else {
    echo "Кирпич не пройдет";
}
?>

<h2>Задание 8.</h2>
<?php
$day = 158;
$mon = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12"];
$daysInMon = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
if ($day < 1 || $day > 365) {
    echo "Неправильный  номер дня";
}
?>

<h2>Задание 9.</h2>
<?php
$a = 15;
if ($a % 4 == 0 && $a % 6 == 0) {
    echo "Число делится";
} else {
    echo "Число не делится"; 
}
?>